# Python review

This class is intended to cover the basic Python knowledge you need to understand the code for the rest of the course. There could be the chance that many of you know this, but this is something to ensure we are all on the same track and have a taste of the tools we will use during the course.

**Python** is an interpreted, high-level, general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python's design philosophy emphasizes code readability with its notable use of significant *whitespace*. Python supports multiple programming paradigms, including procedural, object-oriented, and functional programming. Python is often described as a "batteries included" language due to its comprehensive standard library.

However, Python is far more than its standard library. For instance, Python has been embraced by the Machine Learning community as a standard programming language, mainly because it is open source. Many packages are available to do almost everything you can imagine with Python. 

In this class, we will start with basic concepts to quickly recap the language's syntax and make a journey through the so-called **Python Scientific Stack**.

**why are we talking about Python in a quantitative finance course?** Well, because the financial industry produces a lot of data that can be analyzed, it is hard to find a better tool than Python to deal with data (even a considerable amount of data).

To confirm this, the following is a list of articles that you can read to understand why Python can be a helpful tool and how it is considered in the finance industry:

- [Why are successful FinTech apps built with Python?](https://www.merixstudio.com/blog/why-successful-fintech-apps-are-built-python/)

- [How To Use Python in Finance and Fintech](https://www.netguru.com/blog/how-python-is-used-in-finance-and-fintech)

- [Why Python Should Be the Technology Choice for Your Fintech](https://stxnext.com/blog/2018/09/13/why-python-should-be-technology-choice-your-fintech/)

- [Python for FinTech â€” FinTech Projects and Use Cases](https://www.softkraft.co/python-for-fintech/)

- [9 Outstanding Reasons to Learn Python for Finance](https://blog.boot.dev/python/learn-python-for-finance/)

Let's start by introducing the basic use of this programming language. To understand how to use a Jupyter Notebook (this type of file), try the User Interface Tour under Help on the top left of the screen.

We will use Jupyter notebooks because they are great tools for research and teaching, allowing for interactive code execution.

##  Python as a calculator

In [ ]:
2 * 3

In [ ]:
2**3

In [ ]:
10 / 3

In [ ]:
10 // 3

In [ ]:
10 % 3

In [ ]:
2 > 3

In [ ]:
6 == 2 + 1 * 2
# 6==(2+1)*2

In [ ]:
1 != 2

## Python as a programming language

### Import modules and Packages

In [ ]:
import numpy

In [ ]:
numpy.sqrt(4)

In [ ]:
from numpy import sqrt

In [ ]:
sqrt(4)

In [ ]:
from numpy import sqrt as square_root

In [ ]:
square_root(4)

### Instantiate a variable

In [ ]:
x = 10

In [ ]:
x

In [ ]:
x = x + 5

In [ ]:
x

**REMARK**: Jupyter notebooks are great for learning, but pay attention...cells are not necessarily executed sequentially

In [ ]:
# +=

In [ ]:
x += 5

In [ ]:
x

In [ ]:
x -= 5

In [ ]:
x

In [ ]:
x *= 3

In [ ]:
x

### Buillt-in Datatypes

In programming, the data type is an important concept. Variables can store data of different types, and different types can do different things. Python has several data types built-in by default. In these categories, you can find:

- Numeric Types:	`int`, `float`, `complex`
- Text Type:	`str`
- Sequence Types:	`list`, `tuple`, `range`
- Mapping Type:	`dict`
- Set Types:	`set`, `frozenset`
- Boolean Type:	`bool`

Let's explore how you can create those different types of data. Use `type()` function to check the datatype of a variable.

**REMARK**: You can "turn off" a piece of code by commenting it using "#" before a line. In this way, you are telling Python not to read and interpret that line. It can also be helpful if you want to write some comments about your code to make it more readable and understandable to whom he will read it.

#### Numeric Types

In [ ]:
# int
x = 12

In [ ]:
type(x)

In [ ]:
# float
y = 12.5

In [ ]:
type(y)

In [ ]:
# Complex
z = 1 + 2j

In [ ]:
type(z)

It is possible to change datatype of a variable, for instance transforming a `float` variable to a `int` variable or vice versa.

In [ ]:
y

In [ ]:
y_int = int(y)

In [ ]:
type(y_int)

In [ ]:
type(y)

In [ ]:
type(int(y))

In [ ]:
type(y)

In [ ]:
z = 1474239.4

In [ ]:
type(z)

In [ ]:
z[0]

In [ ]:
dir(z)

In [ ]:
int(z).is_integer()

In [ ]:
z_int = int(z)

In [ ]:
dir(z_int)

#### Text types

Enclose the string between quotes. Single quotes ' or double quotes " produces the same effect. It is just a matter of style, so you can use which you prefer.

In [ ]:
string1 = "test1"

In [ ]:
type(string1)

In [ ]:
len(string1)

In [ ]:
string2 = "test2"

In [ ]:
# in this case the presence of an apostrophe is causing an issue
string3 = "I'd like to create a string"

In [ ]:
# solve it by using different type of quotes
string3 = "I'd like to create a string"

In [ ]:
string3

In [ ]:
# or by putting a backslash in front of the apostrophe
string3 = "I'd like to create a string"

In [ ]:
type(string1)

In [ ]:
type(string1)
print(type(string2))

In [ ]:
string1 + string2

In [ ]:
len(string1 + string2)

In [ ]:
string3 * 4

In [ ]:
# use double quotes three times in a row if you want to create string on multiple lines
string5 = """
comment1
comment2
comment3
"""

In [ ]:
string5

In [ ]:
print(string5)

In [ ]:
# which is equal to write \n when you want to start a new line
string6 = "\ncommento1\ncommento2\ncommento3\n"

In [ ]:
print(string6)

In [ ]:
# to list the possible method (Python is an Object Oriented Programming language organize in methods) for a variable
dir(string1)

In [ ]:
string1

In [ ]:
# let's check what we can do with the firstly created string
string1.upper()

In [ ]:
string1[4]

In [ ]:
string1[-1]

In [ ]:
string1[1:5]

In [ ]:
string1.capitalize()

In [ ]:
string3.upper()

In [ ]:
string3.lower()

In [ ]:
# find, index e count

In [ ]:
len(string3)

In [ ]:
string3

In [ ]:
string3.find("on")

In [ ]:
dir(string3)

In [ ]:
string3.replace("to create", "to instantiate")

In [ ]:
string3.split()

In [ ]:
dir(string1)

#### Sequence Types
There are three sequence types available in Python:
- `tuple`, which are immutable
- `list`, which are mutable
- `range`, which will be helpful when we will talk about control structures

These types can contain elements, also of different types. The only difference between tuples and lists is that you can not modify variables stored in a tuple after you created it, while you can do it using a list. This may seem irrelevant now, but it is beneficial when writing a complex piece of code.

In [ ]:
t1 = (1, 2, 3, 4, 5)

In [ ]:
type(t1)

In [ ]:
t2 = ("a", "b", "c", "d", "e")

In [ ]:
type(t2)

In [ ]:
t2[1]

In [ ]:
t2[0]

In [ ]:
t2[-1]

In [ ]:
t2[1:3]

In [ ]:
t2[0] = "z"

In [ ]:
dir(t2)

In [ ]:
t2.index("c")

In [ ]:
t2[1:3]

In [ ]:
t2 = t2.__add__(("xyz",))

In [ ]:
t2

In [ ]:
t2 = t2.__add__(("abc",))

In [ ]:
print(t2)

In [ ]:
t3 = (1, 2, 3, 4, 5, "test", 20.75, "string2")

In [ ]:
t3

In [ ]:
type(t3)

In [ ]:
list1 = ["jan", "feb", "mar"]

In [ ]:
print(list1)

In [ ]:
type(list1)

In [ ]:
len(list1)

In [ ]:
list1[0]

In [ ]:
list1[-1]

In [ ]:
list1[2]

In [ ]:
list2 = ["a", "b", "c", "d", "e", "f"]

In [ ]:
print(list2)

In [ ]:
list2[:2]

In [ ]:
list2[:4]

In [ ]:
list2 * 2

In [ ]:
list3 = list1 + list2

In [ ]:
print(list3)

In [ ]:
list4 = list3[2:4]

In [ ]:
print(list4)

In [ ]:
list3

In [ ]:
del list3[0]

In [ ]:
print(list3)

In [ ]:
dir(list3)

In [ ]:
print(list3)

In [ ]:
list3.append(7)

In [ ]:
print(list3)

In [ ]:
list3.pop(1)

In [ ]:
print(list3)

In [ ]:
list5 = [2, 21, 32, 1, 24, 45, 67, 128, 6]

In [ ]:
list5.sort()

In [ ]:
list5

In [ ]:
list5.extend([34, 56, 127])

In [ ]:
print(list5)

In [ ]:
list5.clear()

In [ ]:
list5

In [ ]:
list6 = [(1, 2), (3, 5), (12, 15)]

In [ ]:
type(list6[0])

In [ ]:
list6[-1]

In [ ]:
list6[0][1]

#### Mapping Type

A particular kind of mapping type in Python is the dictionary, where you can store pairs of `(key,value)`, so that you can easily retrieve the value from its key.

In [ ]:
prices = {"Amazon": 2075.02, "Microsoft": 183.16, "Apple": 319.68}

In [ ]:
type(prices)

In [ ]:
prices

In [ ]:
print(prices["Amazon"])

In [ ]:
prices["Apple"] = 340

In [ ]:
print(prices)

In [ ]:
prices.keys()

In [ ]:
prices.values()

In [ ]:
del prices["Microsoft"]

In [ ]:
print(prices)

In [ ]:
len(prices)

In [ ]:
prices = {100: 2075.02, 1: 183.16, 2: 319.68}

In [ ]:
prices

In [ ]:
prices[100]

In [ ]:
dir(prices)

#### Set Types
A Set is an unordered collection data type that is mutable and has no duplicate elements. Python's set represents the mathematical notion of a set. A `frozenset` is just an immutable version of a set.

In [ ]:
set1 = {888, 999, 2, 1, 23}

In [ ]:
print(set1)

In [ ]:
[float(i) for i in list(set(sorted(set1)))]

In [ ]:
len(set1)

In [ ]:
set1

In [ ]:
5 in set1

In [ ]:
128 in set1

In [ ]:
set2 = {
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    3,
    3,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    5,
    5,
    5,
}

In [ ]:
print(set2)

In [ ]:
set1.add(28)

In [ ]:
set1

In [ ]:
frozen_set1 = frozenset(set1)

In [ ]:
type(frozen_set1)

In [ ]:
frozen_set1

In [ ]:
frozen_set1.add(32)

#### Boolean Type
Boolean values are the two constant objects `False` and `True`. They are used to represent truth values (other values can also be considered false or true). In numeric contexts (for example, when used as the argument to an
arithmetic operator), they behave like the integers 0 and 1, respectively. The built-in function `bool()` can be used to cast any value to a Boolean, if the value can be interpreted as a truth value

In [ ]:
type(True)

In [ ]:
# Boolean
True, False

In [ ]:
True or False, True | False

In [ ]:
True and False, True & False

In [ ]:
2 < 3 or 6 == 2 * 4

In [ ]:
type(2 < 3 or 6 == 2 * 4)

In [ ]:
x = 7
y = 14

In [ ]:
x

In [ ]:
y

In [ ]:
x > y

In [ ]:
x < y

In [ ]:
z = 14

In [ ]:
y == z

In [ ]:
x != z

In [ ]:
y != z

In [ ]:
t1 = (1, 3, 4, 6, 7, 12)

In [ ]:
2 in t1

In [ ]:
7 in t1

In [ ]:
"data" < "mining"

In [ ]:
3 < 4 and 4 > 3

In [ ]:
3 < 4 & 4 > 3

In [ ]:
3 > 4 & 4 > 3

In [ ]:
3 < 4 | 4 > 3

In [ ]:
3 == 4 or 4 > 3

### Control Statements and Loops
In Python, all the statements indented by the same number of character spaces after a programming construct are considered to be part of a single block of code. Python uses indentation as its method of grouping statements:

`while expression:
    statement(s)`

#### If - elif - else

In [ ]:
x = 3
y = 4

In [ ]:
# x, y = 4,3

if x > y:
    print(x, ">", y)  # Remark: indentation!!

elif x == y:
    print(x, "equals", y)
else:
    print("Either", x, "<", y, "or x and y are not orderable")

#### for

In [ ]:
companies = ["Amazon", "Apple", "Microsoft"]

In [ ]:
print(companies)

In [ ]:
for comp in companies:
    print("The name of the company is ", comp)
    if comp != "Apple":
        print(comp)

In [ ]:
for element in companies:
    print(element)

#### while

In [ ]:
range(10)

In [ ]:
for i in range(11):
    print(i)

In [ ]:
i = 0

while i in range(10):
    print(i)
    i += 1

In [ ]:
# i = 0
# while 1:
#     print(i)
#     i += 1

#### continue & break

In [ ]:
for i in range(3):
    for j in range(5):
        print(i, j)

In [ ]:
for i in range(3):
    for j in range(5):
        if i == j:
            break
        print(i, j)

In [ ]:
i = 0
while True:
    print(i)
    if i > 5:
        break
    i += 1

#### List comprehension
List comprehensions provide a concise way to create lists. It consists of brackets containing an expression followed by a for clause, then zero or more for or if clauses. The expressions can be anything, meaning you can put in all kinds of objects in lists. The result will be a new list resulting from evaluating the expression in the context of the for and if clauses which follow it.

In [ ]:
a = [1, 2, 3, 4]

In [ ]:
b = []
for i in a:
    power = i**2
    b.append(power)

In [ ]:
b

In [ ]:
b = [i**2 for i in a]

In [ ]:
b

### Functions
#### Built-in functions

In [ ]:
([x for x in dir(__builtin__) if x.islower() and not x.startswith("__")])

In [ ]:
len([1, 2, "text", 4, 5, 5])

In [ ]:
sum([1, 5, 6])

In [ ]:
companies

In [ ]:
sorted(companies)

In [ ]:
sorted(companies, reverse=True)

In [ ]:
sorted(companies, key=len)

#### User-defined functions

In [ ]:
def f(a, b, c):
    return a + b * c

In [ ]:
f(1, 2)

In [ ]:
f(12, 3, 5)

In [ ]:
f(c=3, a=1, b=2)

In [ ]:
f(1, 2, c=3)

In [ ]:
args = [1, 2, 3]
f(*args)

In [ ]:
# function definition with default arguments
def f(a, b, c=3):
    return a + b * c

In [ ]:
f(1, 2)

In [ ]:
f(1, 2, 4)

In [ ]:
def multiply_xy(x, y):
    """We want to multiply x and y"""
    # here the corpus of the function

    return x * y

In [ ]:
multiply_xy(5, 7)

In [ ]:
multiply_xy(12, 6)

##### Whatâ€™s wrong with the following pieces of code?

In [ ]:
x = 7
y = 5

In [ ]:
if x < y:
    print("x is lower than y")
else:
    print("y is greater or equal than x")

In [ ]:
def check_numbers(a, b):
    if a < b:
        print("a is lower than b")
    else:
        print("b is greater or equal than a")

In [ ]:
check_numbers(x, y)

In [ ]:
z = (1, 4, 6, 7, 2, 8)

In [ ]:
type(z)

In [ ]:
def see_tuple(t):
    for n in z:
        print(n)

In [ ]:
tup = (1, 2, 3, 4, 5)

In [ ]:
see_tuple(tup)

In [ ]:
x = 1

while x < 5:
    print(x)
    x = x + 1

In [ ]:
l1 = [4, 5, 7, 8, 12, "text", 15, 21, 45]

In [ ]:
for item in l1:
    if item == "text":
        continue
    print(item)

#### Refactoring to use functions
The above pieces of code presents the following problems:
* uses global variables
* not re-usable except by copy and paste

In [ ]:
def print_numbers_in_list(l):
    for item in l:
        if item == "text":
            continue
        print(item)

In [ ]:
print_numbers_in_list(l1)

#### Functions are re-usable

In [ ]:
l2 = range(20)

In [ ]:
print_numbers_in_list(l2)

#### Functions can be treated the same way as (say) an integer

-  Fuctions can be passed in as arguments
-  Functions can also be returned by functions

In [ ]:
x = 5

In [ ]:
def square(x):
    return x * x

In [ ]:
square(x)

In [ ]:
square(x) ** 0.5

In [ ]:
square2 = lambda x: x * x

In [ ]:
square2(5)

## Numpy package 
NumPy (or Numpy) is a Linear Algebra Library for Python. It is essential because almost all of the libraries in the Scientific Ecosystem rely on NumPy as one of their main building blocks - e.g., **scipy, pandas, statsmodels, scikit-learn**. It can be used to generate data and analyze them. Helpful in doing simulated numerical experiments.

Numpy is also incredibly fast, as it has bindings to C libraries. That is why it is recommended to use a numpy array instead of the lists we have seen in the previous lecture. For more info on why you want to use Arrays instead of lists, check out this great [StackOverflow post](http://stackoverflow.com/questions/993984/why-numpy-instead-of-python-lists).

We will only learn the basics of NumPy and explore the most used functionalities, but it is an extensive package that can do many things.

The base structure in numpy is **ndarray**, used to represent vectors, matrices, and higher-dimensional arrays.

The beauty of having installed **Anaconda** is that Numpy comes with it, so you are ready to start without installing anything else.

## Using Numpy

Numpy has many built-in functions and capabilities. We won't cover them all, but instead, we will focus on some of the most critical aspects of Numpy: vectors, arrays, matrices, and number generation. Let's start by discussing arrays. 

However, first of all, import the package to work with it. 

**REMARK**: *np* is a just a convention to rename the package, and it is recommended to follow it

In [ ]:
import numpy as np

## Creating NumPy Arrays

### From a Python List

We can create an array by directly converting a list or list of lists:

In [ ]:
type(list)

In [ ]:
# REMARK absolutely avoid doing this: list is a keyword for Python and you can get confusion
list = [1, 2, 3]

In [ ]:
type(list)

In [ ]:
# avoid the problem calling the list in another way
my_list = [1, 2, 3]
my_list

In [ ]:
type(my_list)

In [ ]:
np.array(my_list)

In [ ]:
type(np.array(my_list))

In [ ]:
my_matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
my_matrix

In [ ]:
np.array(my_matrix)

### Built-in Methods

There are lots of built-in ways to generate Arrays

#### arange

Return evenly spaced values within a given interval.

In [ ]:
np.arange(0, 10)

In [ ]:
np.arange(0, 11, 2)

#### zeros and ones

Generate arrays of zeros or ones

In [ ]:
np.zeros(3)

In [ ]:
np.zeros((5, 5))

In [ ]:
np.ones(3)

In [ ]:
np.ones((3, 3))

#### linspace
Return evenly spaced numbers over a specified interval.

In [ ]:
np.linspace(0, 10, 3)

In [ ]:
np.linspace(0, 10, 50)

#### eye

Creates an identity matrix

In [ ]:
np.eye(6)

#### diag

Creates a diagonal matrix

In [ ]:
np.diag([1, 2, 3, 4])

#### fromfunction

Construct an array by executing a function over each coordinate. Check the doc to understand how it works: put the cursor between the brackets of the function you want to read the code and press <kbd>Shift</kbd>+<kbd>Tab</kbd>)

In [ ]:
z = np.fromfunction(lambda i, j: i**2 + j**2, (4, 5))

In [ ]:
z

In [ ]:
z[0, 2]

### Random 

Numpy also has lots of ways to create random number arrays:

#### rand
Create an array of the given shape and populate it with
random samples from a uniform distribution
over ``[0, 1)``.

In [ ]:
np.random.rand(2)

In [ ]:
np.random.rand(5, 5)

If you want to be able to produce always the same random numbers, just set a seed. NumPy random seed is simply a function that sets the random seed of the NumPy pseudo-random number generator. It provides an essential input that enables NumPy to generate pseudo-random numbers for random processes. For more information check [here](https://stackoverflow.com/questions/21494489/what-does-numpy-random-seed0-do).

In [ ]:
np.random.seed(23)
np.random.rand(2, 2)

In [ ]:
np.random.seed(1)
print(np.random.rand(2, 2))
print()
print(np.random.rand(5, 5))

In [ ]:
np.random.rand(10)

#### randn

Return a sample (or samples) from the "standard normal" distribution. Unlike rand which is uniform:

In [ ]:
np.random.randn(2)

In [ ]:
np.random.randn(5, 5)

#### randint
Return random integers from `low` (inclusive) to `high` (exclusive).

In [ ]:
np.random.randint(1, 100)

In [ ]:
np.random.randint(1, 10000, 10)

## Array manipulation: Attributes and Methods

In [ ]:
x = np.random.randint(1, 100, (4, 5))
x

In [ ]:
type(x)

In [ ]:
x.shape

In [ ]:
x.size

In [ ]:
x.dtype

In [ ]:
x.astype(np.float64)

In [ ]:
x_transpose = x.T

In [ ]:
x_transpose

In [ ]:
# Returns an array containing the same data with a new shape.
x.reshape(2, -1).shape

In [ ]:
x.reshape(2, 3)

In [ ]:
x

In [ ]:
x.max()

In [ ]:
x.argmax()

In [ ]:
x.min()

In [ ]:
x.argmin()

In [ ]:
x.dtype

## Array indexing and selection

### Bracket Indexing and Selection

The simplest way to pick one or some elements of an array looks very similar to python lists

The general format for indexing a 2D array (matrices) is **arr_2d[row][col]** or **arr_2d[row,col]**. I recommend usually using the comma notation for clarity.

In [ ]:
x

In [ ]:
x.shape

In [ ]:
x[0]

In [ ]:
x[0, -1]

In [ ]:
x[:, 1]

In [ ]:
x[-1]

In [ ]:
x[1, 1]

In [ ]:
x[:, 1:3]

In [ ]:
x[[1, 2], 1:3]

### Assignment without copying

Pay attention when you want to duplicate the array you have created. You can incurr in a big mistake. See [StackOverflow post](https://stackoverflow.com/questions/19676538/numpy-array-assignment-with-copy) for further information.

In [ ]:
# if the starting number is 0, you can also omit it
arr = np.arange(0, 11)
arr

In [ ]:
# Setting a value with index range (Broadcasting)
arr[0:2] = 100

# Show
arr

In [ ]:
# Reset array, we'll see why I had to reset in  a moment
arr = np.arange(0, 11)

# Show
arr

In [ ]:
# Important notes on Slices
arr_copy = arr.copy()
slice_of_arr = arr_copy[0:6]

# Show slice
slice_of_arr

In [ ]:
# Change Slice
slice_of_arr[:] = 99

# Show Slice again
slice_of_arr

Now note the changes also occur in our original array!

In [ ]:
arr

Data is not copied, it's a view of the original array! This avoids memory problems!

In [ ]:
# To get a copy, need to be explicit
arr_copy = arr.copy()

### Conditional (Boolean) Selection

This is a very fundamental concept that will directly translate to pandas later on.

Let's briefly go over how to use brackets for selection based off of comparison operators.

In [ ]:
True, False

In [ ]:
arr = np.arange(1, 11)
arr

In [ ]:
arr[4:]

In [ ]:
arr > 4

In [ ]:
bool_arr = arr > 4

In [ ]:
bool_arr.shape

In [ ]:
arr.shape

In [ ]:
x = np.random.randn(10)
x

In [ ]:
bool_x = x > 0

In [ ]:
x[bool_x]

In [ ]:
arr[bool_arr]

In [ ]:
arr[arr > 2]

In [ ]:
x = 2
arr[arr > x]

## Calculations and broadcasting
Broadcasting refers to the set of rules that numpy uses to perfrom operations on arrays with different shapes. In some cases, subject to certain constraints, the smaller array is â€œbroadcastedâ€ across the larger array so that they have compatible shapes.

In [ ]:
x = np.fromfunction(lambda i, j: i**2 + j**2, (2, 3))
x

In [ ]:
x * 5

In [ ]:
x + x

In [ ]:
x * 2

In [ ]:
x @ x.T

In [ ]:
x.T @ x

In [ ]:
x.shape

In [ ]:
y = np.fromfunction(lambda i, j: i**2 + j**2, (3, 3))
y

In [ ]:
x @ y

In [ ]:
np.log1p(x)  # log(1+x)

In [ ]:
x

In [ ]:
np.log(x)

In [ ]:
np.exp(x)

In [ ]:
y.shape

In [ ]:
print(x)
y = np.array([1, 2, 3])
print()
print(x + y)  # y is broadcasted to a 2x3 array

## Combining and splitting arrays

In [ ]:
x

In [ ]:
# row-wise merging
np.r_[x, x]

In [ ]:
np.vstack([x, x])

In [ ]:
np.concatenate([x, x], axis=0)

In [ ]:
np.c_[x, x]

In [ ]:
np.hstack([x, x])

In [ ]:
np.concatenate([x, x], axis=1)

In [ ]:
# How to split?

y = np.r_[x, x]
y

In [ ]:
np.hsplit(y, 3)

In [ ]:
a, b, c = np.hsplit(y, 3)

In [ ]:
a

In [ ]:
b

In [ ]:
c

In [ ]:
np.vsplit(y, [3])

In [ ]:
np.split(y, [3], axis=0)

In [ ]:
print(y)
np.hstack(np.hsplit(y, 3))  # split & concatenation are inverse operations

## Reductions

In [ ]:
import numpy as np

In [ ]:
y = np.fromfunction(lambda i, j: i**2 + j**2, (3, 3))

In [ ]:
y

In [ ]:
y.sum()

In [ ]:
y.sum(0)  # column sum

In [ ]:
y.sum(1)  # row sum

### Standardize by column mean and standard deviation

In [ ]:
y

In [ ]:
y.std(0)

In [ ]:
z = (y - y.mean(1)) / y.std(1)

In [ ]:
z

### Standardize by row mean and standard deviation

In [ ]:
y.mean(1).shape

In [ ]:
y.mean(1)[:, None].shape

In [ ]:
z = (y - y.mean(1)[:, None]) / y.std(1)[:, None]

In [ ]:
z

In [ ]:
z.mean(1), z.std(1)

In [ ]:
zt = (y.T - y.T.mean(0)) / y.T.std(0)
zt.T

## NumPy Operations

## Arithmetic

You can easily perform array with array arithmetic, or scalar with array arithmetic. Let's see some examples:

In [ ]:
arr = np.arange(0, 10)
arr

In [ ]:
arr + arr

In [ ]:
arr * arr

In [ ]:
arr - arr

In [ ]:
# Warning on division by zero, but not an error!
# Just replaced with nan
arr / arr

In [ ]:
# Also warning, but not an error instead infinity
1 / arr

In [ ]:
arr**3

## Universal Array Functions

Numpy comes with many [universal array functions](http://docs.scipy.org/doc/numpy/reference/ufuncs.html), which are essentially just mathematical operations you can use to perform the operation across the array. Let's show some common ones:

In [ ]:
# Taking Square Roots
np.sqrt(arr)

In [ ]:
# Calcualting exponential (e^)
np.exp(arr)

In [ ]:
np.max(arr)  # same as arr.max()

In [ ]:
np.sin(arr)

In [ ]:
np.log(arr)

You can explore the [Numpy Documentation](https://docs.scipy.org/doc/numpy/index.html) to search across the huge variety of function and methods already implemented.

## Pandas

We recap here the basics of pandas for data analysis. You can think of pandas as a potent version of Excel, with a lot more features. In this section of the course, we will go through the following contents:

* Quick Intro
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging, Joining,and Concatenating
* Operations
* Data Input and Output

Here is the access to [pandas documentation](http://pandas.pydata.org/pandas-docs/stable/)

## Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [1]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ["a", "b", "c"]
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {"a": 10, "b": 20, "c": 30}
rng = range(5, 10)

**Using Lists**

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(labels, my_list)

10    a
20    b
30    c
dtype: object

**NumPy Arrays**

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

**Dictionary**

In [8]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
rng

range(5, 10)

In [11]:
pd.Series(rng)

0    5
1    6
2    7
3    8
4    9
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [12]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
# Even functions (although unlikely that you will use this)
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Numpy operation on a Series
You can do on a series pretty much every operation you would do on a numpy array. The following are just some examples.

In [14]:
x = pd.Series(rng)

In [15]:
type(x)

pandas.core.series.Series

In [16]:
x.sum(), x.mean(), x.std()

(35, 7.0, 1.5811388300841898)

In [17]:
x**2

0    25
1    36
2    49
3    64
4    81
dtype: int64

In [18]:
x >= 8

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [19]:
x

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [20]:
x[x >= 8]

3    8
4    9
dtype: int64

In [21]:
# even positional indexing
x[1:4]

1    6
2    7
3    8
dtype: int64

### Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a dictionary).

Let's see some examples of how to grab information from a Series. Firstly create two series, `ser1` and `ser2`:

In [22]:
ser1 = pd.Series([1, 2, 3, 4], index=["USA", "Germany", "France", "Japan"])

In [23]:
ser1

USA        1
Germany    2
France     3
Japan      4
dtype: int64

In [24]:
ser1.index

Index(['USA', 'Germany', 'France', 'Japan'], dtype='object')

In [25]:
ser2 = pd.Series([1, 2, 5, 4], index=["USA", "Germany", "Italy", "Japan"])

In [26]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [27]:
ser2[["Germany", "Italy"]]

Germany    2
Italy      5
dtype: int64

In [28]:
ser12 = ser1 + ser2

Operations are then also done based off of index:

In [29]:
ser12.dropna(inplace=True)

In [30]:
ser12

Germany    4.0
Japan      8.0
USA        2.0
dtype: float64

## DataFrames

DataFrames are the most powerful instrument of pandas. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [31]:
df = pd.DataFrame(
    np.random.randn(5, 4), index="A B C D E".split(), columns="W X Y Z".split()
)

In [32]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

In [33]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [34]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [35]:
df["W"]

A   -0.269237
B    0.430935
C    0.826975
D   -0.472931
E   -0.279155
Name: W, dtype: float64

In [36]:
# Pass a list of column names
df[["W", "Z"]]

          W         Z
A -0.269237 -1.120604
B  0.430935  0.592279
C  0.826975 -1.187110
D -0.472931  1.081406
E -0.279155 -1.257217

In [37]:
# SQL Syntax
df.Z

A   -1.120604
B    0.592279
C   -1.187110
D    1.081406
E   -1.257217
Name: Z, dtype: float64

DataFrame Columns are just Series

In [38]:
type(df["W"])

pandas.core.series.Series

In [39]:
type(df)

pandas.core.frame.DataFrame

**Creating a new column:**

In [40]:
df["new"] = df["W"] + df["Y"]

In [41]:
df

          W         X         Y         Z       new
A -0.269237  1.478883 -0.711206 -1.120604 -0.980443
B  0.430935  0.694507  0.185454  0.592279  0.616389
C  0.826975  1.416848 -0.897643 -1.187110 -0.070668
D -0.472931 -0.174182 -0.055853  1.081406 -0.528784
E -0.279155  0.813834 -0.429463 -1.257217 -0.708618

**Removing Columns**

In [42]:
df.drop("new", axis=1)

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

In [43]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -0.269237  1.478883 -0.711206 -1.120604 -0.980443
B  0.430935  0.694507  0.185454  0.592279  0.616389
C  0.826975  1.416848 -0.897643 -1.187110 -0.070668
D -0.472931 -0.174182 -0.055853  1.081406 -0.528784
E -0.279155  0.813834 -0.429463 -1.257217 -0.708618

In [44]:
df.drop("new", axis=1, inplace=True)

In [45]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

Can also drop rows this way:

In [46]:
df.drop("E", axis=0)

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406

In [47]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

**Selecting Rows**

In [48]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [49]:
df.loc["B"]

W    0.430935
X    0.694507
Y    0.185454
Z    0.592279
Name: B, dtype: float64

Or select based on position instead of label

In [50]:
df.iloc[:3]

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110

**Selecting subset of rows and columns**

In [51]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

In [52]:
df.loc["A", "Y"]

-0.711206423336495

In [53]:
df.loc[["A", "B"], ["W", "Y"]]

          W         Y
A -0.269237 -0.711206
B  0.430935  0.185454

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [54]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

In [55]:
df > 0

       W      X      Y      Z
A  False   True  False  False
B   True   True   True   True
C   True   True  False  False
D  False  False  False   True
E  False   True  False  False

In [56]:
df[df > 0]

          W         X         Y         Z
A       NaN  1.478883       NaN       NaN
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848       NaN       NaN
D       NaN       NaN       NaN  1.081406
E       NaN  0.813834       NaN       NaN

In [57]:
df[df["X"] > 0]

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
E -0.279155  0.813834 -0.429463 -1.257217

In [58]:
df[df["W"] > 0]["Y"]

B    0.185454
C   -0.897643
Name: Y, dtype: float64

In [59]:
df[df["W"] > 0][["Y", "X"]]

          Y         X
B  0.185454  0.694507
C -0.897643  1.416848

In [60]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

For two conditions you can use | and & with parenthesis:

In [61]:
df[(df["W"] > 0) & (df["Y"] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [62]:
df.values

array([[-0.26923656,  1.47888289, -0.71120642, -1.12060387],
       [ 0.4309345 ,  0.69450682,  0.18545441,  0.59227872],
       [ 0.82697517,  1.41684844, -0.8976434 , -1.18710969],
       [-0.4729313 , -0.17418186, -0.05585266,  1.08140562],
       [-0.27915475,  0.81383411, -0.4294631 , -1.2572167 ]])

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [63]:
df

          W         X         Y         Z
A -0.269237  1.478883 -0.711206 -1.120604
B  0.430935  0.694507  0.185454  0.592279
C  0.826975  1.416848 -0.897643 -1.187110
D -0.472931 -0.174182 -0.055853  1.081406
E -0.279155  0.813834 -0.429463 -1.257217

In [64]:
# Reset to default 0,1...n index
df.reset_index(inplace=True)

In [65]:
newind = "CA NY WY OR CO".split()

In [66]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df["States"] = newind

In [68]:
df

  index         W         X         Y         Z States
0     A -0.269237  1.478883 -0.711206 -1.120604     CA
1     B  0.430935  0.694507  0.185454  0.592279     NY
2     C  0.826975  1.416848 -0.897643 -1.187110     WY
3     D -0.472931 -0.174182 -0.055853  1.081406     OR
4     E -0.279155  0.813834 -0.429463 -1.257217     CO

In [69]:
df.set_index("States")

       index         W         X         Y         Z
States
CA         A -0.269237  1.478883 -0.711206 -1.120604
NY         B  0.430935  0.694507  0.185454  0.592279
WY         C  0.826975  1.416848 -0.897643 -1.187110
OR         D -0.472931 -0.174182 -0.055853  1.081406
CO         E -0.279155  0.813834 -0.429463 -1.257217

In [70]:
df

  index         W         X         Y         Z States
0     A -0.269237  1.478883 -0.711206 -1.120604     CA
1     B  0.430935  0.694507  0.185454  0.592279     NY
2     C  0.826975  1.416848 -0.897643 -1.187110     WY
3     D -0.472931 -0.174182 -0.055853  1.081406     OR
4     E -0.279155  0.813834 -0.429463 -1.257217     CO

In [71]:
df.set_index("States", inplace=True)

In [72]:
df

       index         W         X         Y         Z
States
CA         A -0.269237  1.478883 -0.711206 -1.120604
NY         B  0.430935  0.694507  0.185454  0.592279
WY         C  0.826975  1.416848 -0.897643 -1.187110
OR         D -0.472931 -0.174182 -0.055853  1.081406
CO         E -0.279155  0.813834 -0.429463 -1.257217

In [73]:
df.set_index("W")

          index         X         Y         Z
W
-0.269237     A  1.478883 -0.711206 -1.120604
 0.430935     B  0.694507  0.185454  0.592279
 0.826975     C  1.416848 -0.897643 -1.187110
-0.472931     D -0.174182 -0.055853  1.081406
-0.279155     E  0.813834 -0.429463 -1.257217

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [74]:
outside = ["G1", "G1", "G1", "G2", "G2", "G2"]
inside = [1, 2, 3, 1, 2, 3]

In [75]:
for element in zip(outside, inside):
    print(element)

('G1', 1)
('G1', 2)
('G1', 3)
('G2', 1)
('G2', 2)
('G2', 3)

In [76]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [77]:
# Index Levels
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [78]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [79]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=["A", "B"])
df

             A         B
G1 1 -2.835973  0.005939
   2  1.530076  0.912783
   3 -1.553175  0.898997
G2 1 -1.573197 -1.714163
   2 -0.970930 -0.029585
   3  0.017417 -0.541375

In [80]:
df.index.get_level_values(0)

Index(['G1', 'G1', 'G1', 'G2', 'G2', 'G2'], dtype='object')

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [81]:
df.loc["G1"]

          A         B
1 -2.835973  0.005939
2  1.530076  0.912783
3 -1.553175  0.898997

In [82]:
df.loc["G1"].loc[2]

A    1.530076
B    0.912783
Name: 2, dtype: float64

In [83]:
df.index.names

FrozenList([None, None])

In [84]:
df.index.names = ["Group", "Num"]

In [85]:
df

                  A         B
Group Num
G1    1   -2.835973  0.005939
      2    1.530076  0.912783
      3   -1.553175  0.898997
G2    1   -1.573197 -1.714163
      2   -0.970930 -0.029585
      3    0.017417 -0.541375

In [86]:
df.xs("G1")

            A         B
Num
1   -2.835973  0.005939
2    1.530076  0.912783
3   -1.553175  0.898997

In [87]:
df.loc["G1"]

            A         B
Num
1   -2.835973  0.005939
2    1.530076  0.912783
3   -1.553175  0.898997

In [88]:
df.xs(["G1", 1])

C:\Users\ab978\AppData\Local\Temp/ipykernel_24140/580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -2.835973
B    0.005939
Name: (G1, 1), dtype: float64

In [89]:
df.xs(1, level="Num")

              A         B
Group
G1    -2.835973  0.005939
G2    -1.573197 -1.714163

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [90]:
df = pd.DataFrame({"A": [1, 2, np.nan], "B": [5, np.nan, np.nan], "C": [1, 2, 3]})

In [91]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [92]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [93]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [94]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [95]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [96]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [97]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
df["A"].mean()

1.5

In [99]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [100]:
# Create dataframe
data = {
    "Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
    "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
    "Sales": [200, 120, 340, 124, 243, 350],
}

In [101]:
df = pd.DataFrame(data)

In [102]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [103]:
df.groupby("Company")

You can save this object as a new variable:

In [104]:
by_comp = df.groupby("Company")

In [105]:
by_comp

And then call aggregate methods off the object:

In [106]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [107]:
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [108]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [109]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [110]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [111]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [112]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [113]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [114]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

____

### Example DataFrames

In [115]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

In [116]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [117]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [118]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [119]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [120]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [121]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [122]:
pd.concat([df1, df2, df3], axis=1).fillna(0)

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  B5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

_____
## Example DataFrames

In [123]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

In [124]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [125]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

___

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [126]:
pd.merge(left, right, how="inner", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [127]:
left = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

right = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

In [128]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [129]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [130]:
pd.merge(left, right, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [131]:
pd.merge(left, right, how="outer", on=["key1", "key2"])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [132]:
pd.merge(left, right, how="right", on=["key1", "key2"])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [133]:
pd.merge(left, right, how="left", on=["key1", "key2"])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [134]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [135]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [136]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [137]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [138]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [139]:
left.join(right, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [140]:
import pandas as pd

In [141]:
df = pd.DataFrame(
    {
        "col1": [1, 2, 3, 4],
        "col2": [444, 555, 666, 444],
        "col3": ["abc", "def", "ghi", "xyz"],
    }
)
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [142]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [143]:
df["col2"].nunique()

3

In [144]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [145]:
# Select from DataFrame using criteria from multiple columns
newdf = df[(df["col1"] > 2) & (df["col2"] == 444)]

In [146]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [147]:
def times2(x):
    return x * 2

In [148]:
df["col1"] * 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [149]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [151]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [157]:
df["col1"].sum()

10

In [158]:
df["col1"].apply(sum)

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [162]:
df.head()

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

**Permanently Removing a Column**

In [163]:
df.drop("col2", inplace=True, axis=1)

KeyError: "['col2'] not found in axis"

In [164]:
del df["col1"]

In [165]:
df

  col3
0  abc
1  def
2  ghi
3  xyz

**Get column and index names:**

In [166]:
df.columns

Index(['col3'], dtype='object')

In [167]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [168]:
df

  col3
0  abc
1  def
2  ghi
3  xyz

In [169]:
df = pd.DataFrame(
    {
        "col1": [1, 2, 3, 4],
        "col2": [444, 555, 666, 444],
        "col3": ["abc", "def", "ghi", "xyz"],
    }
)
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [170]:
df.sort_values(by="col2")  # inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

**Find Null Values or Check for Null Values**

In [171]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [172]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

**Filling in NaN values with something else:**

In [173]:
df = pd.DataFrame(
    {
        "col1": [1, 2, 3, np.nan],
        "col2": [np.nan, 555, 666, 444],
        "col3": ["abc", "def", "ghi", "xyz"],
    }
)
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [174]:
df.fillna(0)

   col1   col2 col3
0   1.0    0.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   0.0  444.0  xyz

In [175]:
data = {
    "A": ["foo", "foo", "foo", "bar", "bar", "bar"],
    "B": ["one", "one", "two", "two", "one", "one"],
    "C": ["x", "y", "x", "y", "x", "y"],
    "D": [1, 3, 2, 5, 4, 1],
}

df = pd.DataFrame(data)

In [176]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [177]:
df.pivot_table(values="D", index=["A", "B"], columns=["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

**Typically we will just be either reading csv files directly or using pandas-datareader or quandl. Consider this lecture just a quick overview of what is possible with pandas (we won't be working with SQL or excel files in this course)**

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

## CSV

### CSV Input

In [178]:
df = pd.read_csv("MPG.csv")
df

FileNotFoundError: [Errno 2] No such file or directory: 'MPG.csv'

In [179]:
df["mpg"]

KeyError: 'mpg'

### CSV Output

In [180]:
df.to_csv("modified_MPG.csv", index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [181]:
pd.read_excel("Excel_Sample.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_Sample.xlsx'

### Excel Output

In [182]:
df.to_excel("Excel_Sample.xlsx", sheet_name="Sheet1")